"use client";

import { Accordion, AccordionItem } from "@heroui/accordion";
import Banner from "../_components/banner/banner";

const FAQ = () => {
  const faqData = [
    {
      question: "خدمات نارین افزار سهند؟",
      answer:
        "نارین افزار سهند راهکارهای نرم افزاری هوشمند در زمینه های مالی، فین تک، سیستم های پرداخت و دستگاه های پوز ارائه می دهد که به کسب وکارها کمک می کند تا فرآیندهای خود را بهینه سازی و یکپارچه کنند.",
    },
    {
      question:
        "چگونه می توانم از راهکارهای مالی نارین افزار سهند استفاده کنم؟",
      answer:
        "شما می توانید از طریق تماس تلفنی یا ثبت تیکت درخواست خود را با تیم نارین افزار سهند درمیان بگذارید و از مشاوره متخصصین ما بهره‌مند شوید.",
    },
    {
      question: "پشتیبانی و به روزرسانی نرم افزارها چگونه انجام می شود؟",
      answer:
        "هر زمان که به کمک نیاز داشته باشید، تیم پشتیبانی ما آماده پاسخگویی به شماست. همچنین، نرم افزارها به طور منظم به روزرسانی می شوند تا همواره از آخرین امکانات و ویژگی های موجود بهره مند شوید.",
    },
    {
      question:
        "آیا می توان نرم افزارها را متناسب با نیاز کسب وکار خود سفارشی کرد؟",
      answer:
        "بله! نرم افزارهای ما کاملاً سفارشی سازی می شوند تا متناسب با نیازهای خاص کسب وکار شما عمل کنند. تیم ما با شما همکاری می کند تا تمام ویژگی ها و امکانات لازم را پیاده سازی کرده و تجربه‌ای منحصر به فرد برای شما بسازد.",
    },
    {
      question: "چگونه می توان با نارین افزار سهند همکاری کرد؟",
      answer:
        "برای همکاری با نارین افزار سهند، تنها کافیست با ما تماس بگیرید یا از طریق فرم آنلاین درخواست مشاوره کنید. تیم ما بعد از ارزیابی نیازهای شما، بهترین راهکارها را به شما ارائه خواهد داد تا بتوانید با بهره‌گیری از فناوری‌های پیشرفته، کسب‌وکار خود را ارتقا دهید.",
    },
    {
      question: "نارین افزار سهند در چه شهرهایی فعالیت دارد؟",
      answer:
        "نارین افزار سهند در سراسر ایران فعالیت می کند و خدمات خود را به تمامی کسب وکارها در تمامی شهرها ارائه می دهد. تیم ما آماده همکاری با مشتریان در هر نقطه از کشور است.",
    },
    {
      question: "مزایای راهکارهای مالی نارین افزار سهند؟",
      answer:
        "راهکارهای مالی ما منعطف و بومی سازی شده است و به شما کمک می کنند تا دقت، سرعت و بهره وری خود را افزایش دهید و همچنین فرآیندهای مالی را به طور یکپارچه مدیریت کنید.",
    },
    {
      question: "نرم افزار دستگاه های پوز و سیستم های پرداخت یکپارچه هستند؟",
      answer:
        "بله، نرم افزارهای ما به طور کامل با دستگاه های پوز و سیستم های پرداخت یکپارچه می شوند و کارکردی ساده و بدون پیچیدگی ارائه می دهند.",
    },
    {
      question: "خدمات پشتیبانی به چه صورت است؟",
      answer:
        "پشتیبان های ما ۲۴ ساعته حتی در ایام تعطیل آماده پاسخگویی به سوالات و حل چالش های شما هستند.",
    },
    {
      question: "راه های ارتباطی با نارین افزار سهند",
      answer:
        "برای ارتباط با ما، می توانید از طریق تلفن، ایمیل یا تیکت اقدام کنید. تیم ما آماده پاسخگویی به سؤالات شماست.",
    },
  ];
  return (
    <>
      <div className="flex flex-col gap-16">
        <Banner
          backGroundimageAlt="faq banner image with question marks"
          backGroundimageSrc="/assets/faq/faq.png"
          description="پاسخ تمام ابهامات شما در یک نگاه!"
          title="داستان ما"
          highlightWord={["پاسخ"]}
          classNames={{
            image: "object-[center_0] sm:object-[center_65%]",
          }}
        />
        <div className="p-8 rounded-xl bg-slate-200 container mx-auto xl:max-w-4xl">
          <div>
            <Accordion selectionMode="multiple" variant="splitted" className="gap-4">
              {faqData.map(({ answer, question }, index) => (
                <AccordionItem
                  key={`faq ${index}`}
                  aria-label={question}
                  title={question}
                  classNames={{ title: "cursor-pointer" }}
                >
                  {answer}
                </AccordionItem>
              ))}
            </Accordion>
          </div>
        </div>
      </div>
    </>
  );
};

export default FAQ;
