const Success = () => {
  const successData = {
    title: "دستاوردهای نارین افزار سهند",
    description: `این دستآوردها گواهی بر تالشها و ابتکارات شرکت نارین افزار سهند در جهت تحول
    صنایع و ارائه راهحلهای نوین در حوزه حسابداری و مدیریت مالی هستند که عالوه بر تامین
    سـود شرکتهـا و صنایع، درجهـت رضایت و نفع مـشتریـان عمـل میکند.`,
    ourSuccess: [
      {
        title: "نخستین شتاب دهنده",
        description: `شرکت نارین افزار سهند، بهعنوان اولین
        و تنها شرکت شتابدهنده خدمات حوزه
        حـمـلونـقـل مسافـر بینشهـری، در سـال
        ۱۳۹۷ بـا هـدف سـامـانـدهی پلتفرم مالی
        شرکـتهـای مسافربری تـأسیس گـردید.
        این شرکت با تکیه بر سالها تجربه
        مـدیـران خـود و بـهـرهگیری از دانـش و
        فـنــاوری روز، مـوفـق شـدهاسـت نـقـشی
        بـرجـستـه در هـوشمندسـازی و تـحــول
        سیستـمهـای مـالـی این حـوزه ایـفـا کند.
      `,
      },
      {
        title: "اجرای طرحهای فناورانه",
        description: `نارین افزار سهند با تکیه بر دانش فنی روز و شناخت عمیق از نیاز های مالی صنایع، موفق به طراحی و اجرای محموعه‌ای از راهکار های فناورانه شده است که زیر ساخت های مالی را هوشمند ، شفاف و کامد نموده‌اند از جمله طراحی دستگاه های پوز چند پرداختی با امکان تفکیک مالیاتی وجوه در هر تراکنش ، ایجاد وب سرویس بانکی برای تسویه حساب خودکار ، راه اندازی زیر ساخت های پرداخت یاری درگاه های اختصاصی و ...`,
      },
      {
        title: "پیشگام در ایجادنظم مالی",
        description: `نارین افزار سهند بـا طراحی و اجرای اولین
        نـرمافـزار بـومی و دانشبنیان در صنـعـت
        حـمـلونـقـل بینشهری، تـحـول بـزرگی در
        هوشمندسازی مالی ایجاد کرده است. ایـن
        نرمافـزار بـا یکپـارچهسـازی گردش مــالی،
        حذف واسطـهها و واریز آنـی مبالـغ فروش
        بلیط به حسابهای مرتبط مانند مالکان،
        آژانسها و بیمهها، شفافیت و سهولت در
        تراکنشهـا را به ارمـغـان آورده است.`,
      },
      {
        title: "حامی توسعه پایدار",
        description: `با تمرکز بر دیجیتالیسازی فرآیندهای مالی،
        همـــواره در مسیــر تـوسـعـه پـایـدار گــام
        بـرداشتـهایم. مـا طـی سـالهـا مسیر رشـد،
        سامانههای جزیرهای و محلی را به بسترهای
        یکپارچه تحت وب و سپس پلتفرمهای
        سبـک و قـابـل اجـرا روی مــوبـایـل و
        اپلیکیشنهای شخصیسازیشده تـوســعه
        بخشیدیـم. ایـن تحــول، ضمـن کـاهش
        چشمگیر هـدردرفت منـابـع، امـکان ارائـه
        خدمـات وسیعتـر، بـا پشتیبانی آسـان را
        فراهم نمودهاست.`,
      },
    ],
  };
  return (
    <div className="flex flex-col gap-4 px-8">
      <h6 className="text-2xl font-bold text-primary">{successData.title}</h6>
      <p className="text-sm text-gray-600">{successData.description}</p>
    </div>
  );
};

export default Success;
