const Benefits = () => {
  const features = [
    "مدیریت بهینه ظرفیت ناوگان: ظرفیت اتوبوسها بر اساس تقاضای هر مقصد و پیش از حضور زائران در پایانه، تنظیم میشود که از ازدحام، اتلاف منابع وهزینههای سربار جلوگیری مینماید.",
    "مدیریت بهینه ظرفیت ناوگان: ظرفیت اتوبوسها بر اساس تقاضای هر مقصد و پیش از حضور زائران در پایانه، تنظیم میشود که از ازدحام، اتلاف منابع وهزینههای سربار جلوگیری مینماید.",
    "مدیریت بهینه ظرفیت ناوگان: ظرفیت اتوبوسها بر اساس تقاضای هر مقصد و پیش از حضور زائران در پایانه، تنظیم میشود که از ازدحام، اتلاف منابع وهزینههای سربار جلوگیری مینماید.",
    "مدیریت بهینه ظرفیت ناوگان: ظرفیت اتوبوسها بر اساس تقاضای هر مقصد و پیش از حضور زائران در پایانه، تنظیم میشود که از ازدحام، اتلاف منابع وهزینههای سربار جلوگیری مینماید.",
  ];
  return (
    <div className="my-12 flex flex-col gap-4">
      <h4 className="text-right font-bold title-font-size text-primary">
        مزایای طرح مدیریت حمل‌ونقل زائران اربعین
      </h4>

      <ul className="list-disc pr-5 space-y-2 text-right">
        {features?.map((item, index) => (
          <li key={index} className="p-font-size">
            {item}
          </li>
        ))}
      </ul>
    </div>
  );
};
export default Benefits;
