import SuccessCard from "./successCard";

const SuccessCardContainer = () => {
  const successCardData = [
    {
      title: "نخستین شتاب دهنده",
      description: `شرکت نارین افزار سهند، به عنوان اولین
        و تنها شرکت شتابدهنده خدمات حوزه
        حـمـل و نـقـل مسافـر بین شهـری، در سـال
        ۱۳۹۷ بـا هـدف سـامـانـدهی پلتفرم مالی
        شرکـتهـای مسافربری تـأسیس گـردید.
        این شرکت با تکیه بر سالها تجربه
        مـدیـران خـود و بـهـرهگیری از دانـش و
        فـنــاوری روز، مـوفـق شـدهاسـت نـقـشی
        بـرجـستـه در هـوشمندسـازی و تـحــول
        سیستـمهـای مـالـی این حـوزه ایـفـا کند.`,
      id: 0,
    },
    {
      title: "اجرای طرحهای فناورانه",
      description: `نارین‌افزار سهند با تکیه بر دانش فنی روز و
        شناخت عمیق از نیازهای مالی صنایع، موفق
        به طراحی و اجرای مجموع‌های از راهکارهای
        فناورانه شده است که زیرساختهای مالی را
        هوشمند، شفاف و کارآمد نمودهاند. ازجمله
        طراحی دستگاه‌های پوز چندپرداختی بـا
        امکان تفکیک مالیاتی وجوه در هر تراکنش،
        ایجاد وب سرویس بانکی برای تسویه حساب خودکار، راه‌اندازی زیرساخت‌های پرداخت‌یاری، درگاه‌های اختصاصی و ... .`,
      id: 1,
    },
    {
      title: "پیشگام در ایجادنظم مالی",
      description: `نارین افزار سهند بـا طراحی و اجرای اولین
        نـرم‌افـزار بـومی و دانش‌بنیان در صنـعـت
        حـمـل‌ونـقـل بین‌شهری، تـحـول بـزرگی در
        هوشمندسازی مالی ایجاد کرده است. ایـن
        نرم‌افـزار بـا یکپـارچه‌سـازی گردش مــالی،
        حذف واسطـه‌ها و واریز آنـی مبالـغ فروش
        بلیط به حسابهای مرتبط مانند مالکان،
        آژانس‌ها و بیمه‌ها، شفافیت و سهولت در
        تراکنشهـا را به ارمـغـان آورده است.`,
      id: 2,
    },
    {
      title: "حامی توسعه پایدار",
      description: `با تمرکز بر دیجیتالی‌سازی فرآیندهای مالی،
        همـــواره در مسیــر تـوسـعـه پـایـدار گــام
        بـرداشتـهایم. مـا طـی سـالهـا مسیر رشـد،
        سامانه‌های جزیره‌ای و محلی را به بسترهای
        یکپارچه تحت وب و سپس پلتفرمهای
        سبـک و قـابـل اجـرا روی مــوبـایـل و
        اپلیکیشنهای شخصی‌سازی‌شده تـوســعه
        بخشیدیـم. ایـن تحــول، ضمـن کـاهش
        چشمگیر هـدردرفت منـابـع، امـکان ارائـه
        خدمـات وسیعتـر، بـا پشتیبانی آسـان را
        فراهم نموده‌است.`,
      id: 3,
    },
  ];

  return (
    <div
      style={{
        backgroundImage: `url(/assets/landingImage/achivment.png)`,
      }}
      className="bg-cover bg-no-repeat xl:bg-[center_-10rem] p-4 sm:px-10 md:py-20 text-white relative flex items-center"
    >
      <span className="absolute inset-0 backdrop-grayscale-100"></span>

      <div className="grid grid-cols-1 md:grid-cols-2 xl:grid-cols-4 gap-8 container mx-auto px-4 z-[1]">
        {successCardData.map((item, index) => (
          <SuccessCard {...item} key={`success card ${index}`} />
        ))}
      </div>
    </div>
  );
};

export default SuccessCardContainer;
